        IDENTIFICATION DIVISION.
        PROGRAM-ID. HELLOWORLD.

        ENVIRONMENT DIVISION.
        CONFIGURATION SECTION.
        DATA DIVISION.
          WORKING-STORAGE SECTION.
            01 TEST-LINK-DATA.
              03 WORK-NUM-1 PIC 9(03).
              03 WORK-RESULT PIC 9(03).

        PROCEDURE DIVISION.
        DISPLAY "Hello World!!".

        CALL "GEO3X3" USING TEST-LINK-DATA.
        DISPLAY "VALUE = " WORK-RESULT UPON CONSOLE.

        STOP RUN.
